"use client";
import React, { useState } from "react";

const DescriptionText: React.FC = () => {
  const textData = [
    {
      title: "کلاس زبان آنلاین؛ یک شروع امیدوارکننده",
      text: "در دنیای امروزی آموزش و یادگیری یک اصل ضروری برای پیشرفت و حرکت روبه‌جلو است. وقتی هم که صحبت از آموزش و مهارت اندوزی می شود، هیچ چیز به اندازه یادگیری زبان اهمیت ندارد. در این کلاس ای که ما در آن قرار داریم، یادگیری زبان از آن دست کارهایی است که نمی شود در انجام آن تردید کرد. تا زمانی که به یک زبان زنده دنیا مسلط نشویم، عملا نمی توانیم با جهان خارج ارتباط برقرار کنیم و فرصت پیدا نمی کنیم که از دنیای محدود خود بیرون بیاییم. البته می دانیم که خود شما هم از اهمیت یادگیری زبان اطلاع دارید. فقط یک مشکل بزرگ وجود دارد: وقت و حوصله حضور در کلاس زبان و یادگیری به روش سنتی را ندارید. به چیزی نیاز دارید که خیلی بهتر و سریع تر نیازتان را برطرف کنید. و خب راه حل این مشکل ساده است و در همه جای دنیا هم جواب خود را به خوبی پس داده است: زبان را به صورت آنلاین بیاموزید و بعد از مدتی کوتاه از پیشرفت خود شگفت زده شوید. مزایای کلاس خصوصی و کلاس گروهی زبان آنلاین آنقدر زیاد است که نمی شود در یک مطلب کوتاه به آن اشاره کرد، اما اجازه بدهید یک نگاه مختصر به بعضی از مهمترین آنها داشته باشیم و سپس شما را با یک جای مطمئن برای برگزاری کلاس های گروهی و کلاس ای زبان آشنا کنیم.",
    },
    {
      title: "یادگیری همراه با بهترین اساتید زبان",
      text: "در کلاس های آنلاین زبان دست شما برای انتخاب اساتید مطرح و حرفه ای زبان باز است. می توانید از میان ده ها استاد مختلف، فرد مد نظر خودتان را انتخاب کرده و کلاس گروهی خود را شروع کنید. در وب سایت های معتبر آموزش زبان، از جمله همیارزبان، ما امکان مشاهده نظرات سایر زبان آموزان را هم برای شما فراهم کرده ایم. به این ترتیب ضمن تماشای معرفی ویدئوی استاد، بررسی رزومه او و خواندن نظرات دیگران، می توانید با اطلاع کامل بهترین معلم زبان را برای خودتان انتخاب کنید.",
    },
    {
      title: "صرفه جویی در وقت و بهره وری بالا",
      text: "لازم نیست ساعت ها اسیر ترافیک و آلودگی هوا شوید؛ تنها کافی است از طریق کامپیوتر یا گوشی موبایل خود وارد کلاس گروهی آنلاین خود شوید و را در کوتاه ترین زمان به همراه معلم خصوصی خود آن را برگزار کنید. با این اوصاف دیگر نگران خستگی راه هم نخواهید بود و از وقت خود بیشترین استفاده را می برید.",
    },
    {
      title: "برنامه ریزی مطابق با برنامه شخصی",
      text: "می دانیم که تقصیر شما نیست. کارهای روزمره آنقدر زیاد است که هر کدام از ما ممکن است یک جا کم بیاوریم و قید کلاس زبان را بزنیم. البته این مسئله مربوط به کلاس های حضوری بود که روز و ساعتِ کلاس از قبل مشخص شده و هیچ انعطافی هم نداشتند، ولی در حوزه آموزش آنلاین زبان مسئله کاملا متفاوت است. در اینجا می توانید در هر روز و ساعتی که می خواهید کلاس زبان مدنظرتان را رزرو کنید و حتی ترسی از کنسل کردن کلاس گروهی زبان خود نداشته باشید. مثلا اگر برایتان یک کار فوری پیش بیاید، می توانید به معلم خود خبر بدهید و با توافق هم، کلاس را به یک زمان دیگر منتقل کنید. به همین راحتی!",
    },
    {
      title: "یادگیری زبان با هزینه مناسب در کلاس گروهی زبان",
      text: "ما در همیارزبان فکر جیب شما را هم کرده ایم. اصلا امکان تشکیل کلاس گروهی زبان را به همین خاطر فراهم آورده ایم. شما می توانید با دوستان خود، یا حتی با کسانی که از قبل با آنها آشنایی نداشته اید، یک کلاس تشکیل دهید و فرایند یادگیری زبان خود را شروع کنید. به این ترتیب هزینه ها سرشکن می شوند و می توانید با قیمتی بسیار مقرون به صرفه، زبان یاد بگیرید.",
    },
    {
      title: "همیارزبان یک همراه مطمئن برای یادگیری زبان",
      text: "سایت های یادگیری زبان کم نیستند، اما آن مجموعه هایی که واقعا کار خودشان را بلد باشند، به تعداد انگشتان یک دست هم نمی رسند. همیارزبان یکی از همین مجموعه ها است. اعتبار مجموعه همیارزبان که حاصل سال ها فعالیت در حوزه آموزش و یادگیری زبان است، خود گویای این مسئله است. فرقی ندارد که هدف شما از یادگیری زبان چیست؛ می خواهید مهاجرت کنید، قصد انجام کار تجاری دارید و یا دوست دارید با یادگیری زبان کارهای روزمره تان را بهتر از قبل انجام دهید. ما برای هر هدفی برنامه مشخصی داریم. اگر هم فکر هزینه ها هستید و در عین حال می خواهید کیفیت کلاستان بالا باشد، کافی است یک بار کلاس گروهی زبان در همیارزبان را تجربه کنید؛ مطمئنا همراه همیشگی ما خواهید شد!",
    },
  ];

  const [showAll, setShowAll] = useState(false);

  return (
    <div>
      {textData.slice(0, showAll ? textData.length : 2).map((item, index) => (
        <div key={index} className="mb-4 flex flex-col gap-y-4">
          <h3 className="text-black font-iranSansBold text-2xl font-medium lg-max:text-base">
            {item.title}
          </h3>
          <p className="text-[#555] leading-8 text-base lg-max:text-sm lg-max:leading-6 text-justify">
            {item.text}
          </p>
        </div>
      ))}
      {textData.length > 2 && (
        <button
          onClick={() => setShowAll(!showAll)}
          className="text-[#0CAC67] text-center mx-auto w-full font-medium text-base leading-8 lg-max:text-sm lg-max:leading-7"
        >
          {showAll ? "مطالعه کمتر" : "مطالعه بیشتر"}
        </button>
      )}
    </div>
  );
};

export default DescriptionText;
